#include <iostream>
#include <math.h>
using namespace std;
int main()
{
	float a,p;
	float B[6]={3.2,2.1,2.2,3.1,4.2,-3};              //задаємо масив;
	int i;         
	p=1;                                             //добуток=1;
	for (int i=0;i<5;i++)
	{
       a=B[i]-B[i+1];                               //перший член віднімає сусудній,і потім виконується добуток,так кожного разу до того часу поки і<5;
       p=p*a;                                       //відповідь виходить 0 ,тому що {2} і {3} елементи рівні ,тобто 2.1-2.1=0 і виходить 0 множиться на всі наступні різниці;
    }  
	cout << "p = "<< p <<endl;
	system("pause");
	return(0);
}
