#include <iostream>
#include <math.h>
#include <cstdlib>
using namespace std;
int main()
{
	int m=3;
    int X[m];
	int i,j;
	float A[3][3];                           //вводимо двохвимірний масив;
	for(i=0;i<3;i++)
	for(j=0;j<3;j++)
	{
		cout<<"A["<<i<<"]["<<j<<"]=";
		cin>>A[i][j];
	}
	cout<<endl;
	int k=0;                                 //k для того щоб задати умову;
for(i=0;i<3;i++)
for(j=0;j<3;j++)
{
	if((i+j)==m-1)                         
	{
	X[k]=pow(A[i][j],2);                   //тобто,якщо виконується умова то k буде спочатку 0,потім 1,2,буде збільшуватись поки виконується умова if;якщо знайдеться елемент який задовільняє умову то k збільшиться;
    k++;
	}
}
	for(i=0;i<3;i++)                         //записуємо for для того  щоб нам вивести одновимірний масив знизу;
	cout<<"X["<<i<<"]="<<X[i]<<endl;         //тобто через те, що записали for нам виведе X[0],X[1],X[2].
	system("pause");
	return(0);	
}
